#+HUGO_BASE_DIR: ~/projects/exaclior.github.io/
#+HUGO_SECTION: posts
#+TITLE: The First Computer Algebra System: Maxima
#+SUBTITLE: Setup and Operator Algebra
#+DESCRIPTION: Setup Maxima for Quantum Mechanics
#+AUTHOR: Yusheng Zhao
#+DATE: <2024-01-04 Thu>
#+EXPORT_HUGO_TAGS: t
#+filetags: Setup CAS Maxima

** Installation
To install ~maxima~, we simply rely on our favourite package manager. For
example, on a Mac, you can do

#+begin_src shell
brew install maxima
#+end_src

After installing ~maxima~, you will need a ~lisp~ compiler in order to run it. You can do that by

#+begin_src shell
brew install sbcl
#+end_src

Let's verify that we have successfully installed ~maxima~.

#+begin_src shell :results raw
maxima
#+end_src

#+RESULTS:
Maxima 5.47.0 https://maxima.sourceforge.io
using Lisp SBCL 2.4.0
Distributed under the GNU Public License. See the file COPYING.
Dedicated to the memory of William Schelter.
The function bug_report() provides bug reporting information.
(%i1)

Looks like we are able to start the ~maxima~ repl successfully.

** Configuration

I will be mainly interacting with ~maxima~ either through ~org-babel~ or the
terminal directly. Therefore, I will not demonstrate how to install a GUI
frontend for ~maxima~. The interested user should find [[https://themaximalist.org/about/my-mac-os-installation/][this guide]] helpful.

In order to run ~maxima~ in ~org-mode~, we have to install ~Maxima.el~ package
in ~Emacs~. You may use the following code from the [[https://github.com/emacsmirror/maxima][package repo]] in your config.
I used ~use-package!~ because I am using ~doom emacs~.

#+begin_src emacs-lisp
(use-package! maxima
  :init
  (setq org-format-latex-options (plist-put org-format-latex-options :scale 2.0)
	  maxima-display-maxima-buffer nil)
  (add-to-list 'auto-mode-alist
		 (cons "\\.mac\\'" 'maxima-mode))
  (add-to-list 'interpreter-mode-alist
		 (cons "maxima" 'maxima-mode)))
#+end_src

For ~maxima~ to be available to ~org-babel~, the following configuration is
necessary.

#+begin_src emacs-lisp
(org-babel-do-load-languages
 'org-babel-load-languages
 '((maxima . t)))
#+end_src

Now, we can use ~maxima~ in ~org-babel~.

#+begin_src maxima :results raw
programmode: false;
tex(diff(exp(x)^2));
#+end_src

#+RESULTS:
(linenum:0,
$$2\,e^{2\,x}\,dx$$

*** Search Path Expansion
A simple way of including other's code is to include the file containing the
code. Assuming the external library you would like to include is in file
~something.mac~.

#+begin_src maxima
load("something.mac");
#+end_src

To include a larger library with multiple files, you could follow the
instruction in [[https://github.com/dprodanov/clifford][Clifford]]'s repo.

Firstly, clone the repo to your local machine.

#+begin_src shell
cd ~/projects/
git clone git@github.com:dprodanov/clifford.git
#+end_src

Then, you would add the path of this repo to Maxima's search path.

#+begin_src maxima :results raw
file_search_demo: append (file_search_demo,["~/projects/clifford/$$$.{dem.wxm}"]);

file_search_maxima: append (file_search_maxima,["~/projects/clifford/$$$.{mac,wxm}"]);

setup_autoload ("clifford.mac", clifford);

load(clifford);
tex(clifford(dx,3));
#+end_src

#+RESULTS:
(linenum:0,
define: warning: redefining the built-in function clifford
package name: clifford.mac
author:  Dimiter Prodanov
version: v25
Recommended location: share/contrib
last update: 9 May 2023
$$\left[ 1 , 1 , 1 \right] $$

Interested reader should try [[https://github.com/dprodanov/clifford/tree/master/examples][these examples]] given in the Clifford package repo.

** Code
#+begin_src maxima :results raw
#+end_src

#+RESULTS:
(linenum:0,
/var/folders/m0/scg25fdd0xs9pwzh00xrs7wr0000gn/T/babel-FQ5eGA/maxima-0vfvCq.max:7:62:incorrect syntax: RETURN(SQRT(X)); END; is not an infix operator
turn(sqrt(x)); end;"
                  ^

* Outlooks

There is a [[https://thingwy.blogspot.com/2015/07/maxima-versus-mathematica-should-i-go.html][blog]] written in 2015 that compares the result of some real world
usage of ~Maxima~ vs ~Mathematica~. The conclusion is that ~Maxima~ will return
either *incorrect* or *no* result at all for some problems.

Let's verify some of the problems still exist:

#+begin_src maxima :results raw
programmode: false;
tex(integrate(1/(x^2 - x^3)^(1/3),x,0,1));
#+end_src

#+RESULTS:
$$\int_{0}^{1}{{{1}\over{\left(x^2-x^3\right)^{{{1}\over{3}}}}}\;dx}$$

It seems like at least this problem still remains.

